In [21]:
import pandas as pd
from pathlib import Path

In [25]:
asset_path = Path(".").parent / 'assets'

WindowsPath('G:/Projects/data science/ai-ml/pandas/assets')

In [3]:
cars = pd.Series(['Buggati', 'Audi', 'Mercedes'])
cars

0     Buggati
1        Audi
2    Mercedes
dtype: object

In [4]:
colors = pd.Series(['Red', 'Blue', 'Black'])
colors

0      Red
1     Blue
2    Black
dtype: object

In [5]:
car_data = pd.DataFrame({'Car': cars, 'Color': colors})
car_data

        Car  Color
0   Buggati    Red
1      Audi   Blue
2  Mercedes  Black

In [27]:
car_csv = asset_path / 'csv'/ 'car-sales.csv'
car_sales = pd.read_csv(car_csv)
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

Pandas use DataFrames and Series to store data

![image.png](../assets/images/pandas-anatomy-of-a-dataframe.png)

In [29]:
export_path = asset_path / 'csv'/ 'exported-car-sales.csv'
car_sales.to_csv(export_path, index=False)

In [30]:
car_sales.mean(numeric_only=True)

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [31]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [32]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [33]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [34]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [43]:
len(car_sales)
car_sales['Doors'].sum()

40

In [ ]:
car_csv.